In [1]:
import pandas as pd
df = pd.read_csv("D:/Datasets/simple_data.csv")

In [2]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

# Sıralalama (sort_values)

In [3]:
# aylik_gelir'e göre sıralama

In [3]:
df.sort_values("aylik_gelir").head()

    sirano   isim  yas       meslek    sehir  aylik_gelir
0        1  Cemal   35         Isci   Ankara         3500
12      13  Hakkı   33        Memur    Çorum         3750
1        2  Ceyda   42        Memur  Kayseri         4200
3        4  Burcu   29  Pazarlamaci   Ankara         4200
11      12  Harun   43      Tornacı   Ankara         4200

# Azalan sıralama

In [5]:
# Varsayılan olarak sıralama artan sıralamadır. Büyükten küçüğe 
# sıralamak istersek sort_values() içine ascending=False
# demeliyiz.

In [4]:
df.sort_values("aylik_gelir", ascending=False).head()

    sirano      isim  yas    meslek     sehir  aylik_gelir
8        9     Ahmet   33    Doktor    Ankara        18000
13      14   Gülizar   37    Doktor     İzmir        14250
7        8     Murat   31  Müzisyen  Istanbul        12000
9       10  Muhittin   46    Berber  Istanbul        12000
2        3     Timur   30  Müzisyen  Istanbul         9000

# Birden Fazla Sütun için Sıralama

In [7]:
df.sort_values(["aylik_gelir","yas"], ascending=[False,True]).head(10)

    sirano      isim  yas       meslek     sehir  aylik_gelir
8        9     Ahmet   33       Doktor    Ankara        18000
13      14   Gülizar   37       Doktor     İzmir        14250
7        8     Murat   31     Müzisyen  Istanbul        12000
9       10  Muhittin   46       Berber  Istanbul        12000
2        3     Timur   30     Müzisyen  Istanbul         9000
15      16    Gençay   46       Berber    Ankara         8800
16      16    Gençay   46       Berber    Ankara         8800
14      15    Şehmuz   41          NaN    Ankara         8700
6        7     Dilek   29  Pazarlamaci  Istanbul         7300
4        5   Yasemin   23          NaN     Bursa         4800

In [8]:
# 12.000 ve 8.800 gelirli olanların yaşlarına dikkat ediniz

# Filtreleme

In [8]:
# Mesleği doktor olanlar
# df[filtelemeyi sağlayacak koşul(lar)]

In [5]:
# Mesleği doktor olanlar
df[df.meslek == 'Doktor']

    sirano     isim  yas  meslek   sehir  aylik_gelir
8        9    Ahmet   33  Doktor  Ankara        18000
13      14  Gülizar   37  Doktor   İzmir        14250

In [6]:
# Mesleği Müzisyen olanlar ve aylik_gelir 10000'den büyük olanlar
df[(df["meslek"] == "Müzisyen") & 
   (df["aylik_gelir"] > 10000)]

   sirano   isim  yas    meslek     sehir  aylik_gelir
7       8  Murat   31  Müzisyen  Istanbul        12000

In [11]:
# Mesleği Doktor ya da Berber olanlar

In [8]:
df[(df["meslek"] == "Doktor") | 
   (df["meslek"] == "Berber")
  ]

    sirano      isim  yas  meslek     sehir  aylik_gelir
8        9     Ahmet   33  Doktor    Ankara        18000
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800

# query() metodu ile sql where tarzı filtreleme

In [9]:
doc_or_berb = df.query(" meslek == 'Doktor' | meslek == 'Berber' ")
doc_or_berb.head()

    sirano      isim  yas  meslek     sehir  aylik_gelir
8        9     Ahmet   33  Doktor    Ankara        18000
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800

In [10]:
gt_10000 = df.query(" aylik_gelir > 10000 ")
gt_10000.head()

    sirano      isim  yas    meslek     sehir  aylik_gelir
7        8     Murat   31  Müzisyen  Istanbul        12000
8        9     Ahmet   33    Doktor    Ankara        18000
9       10  Muhittin   46    Berber  Istanbul        12000
13      14   Gülizar   37    Doktor     İzmir        14250

# Filteleme ve Sıralamanın Birlikte Kullanımı

In [15]:
# Önce filtreleme sonra sıralama

In [11]:
df[(df["meslek"] == "Doktor") | (df["meslek"] == "Berber") ].sort_values("aylik_gelir").head()

    sirano      isim  yas  meslek     sehir  aylik_gelir
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
8        9     Ahmet   33  Doktor    Ankara        18000

# unique() ile benzersiz kategorileri elde etme

In [12]:
df.meslek.unique()

array(['Isci', 'Memur', 'Müzisyen', 'Pazarlamaci', nan, 'Doktor',
       'Berber', 'Tuhafiyeci', 'Tornacı'], dtype=object)

# distinct count

In [13]:
len(df.meslek.unique())

9

<h1 style="color:blue";> 02_pandas: alıştırma - 2</h1>

In [27]:
# Advertising.csv veri seti üzerinde

# 1. Sales'e göre azalan sıralama
# 2. TV bütçesinin 50 den küçük olduğu kayıtlar
# 3. TV bütçesinin 50'den küçük olduğu kayıtları Sales'e göre azalan sıralama yapınız.